<?xml version="1.0" encoding="utf-8" standalone="yes"?><rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom"><channel><title>syntax on 仲夏园</title><link>https://goplscn.github.io/tags/syntax/</link><description>Recent content in syntax on 仲夏园</description><generator>Hugo -- gohugo.io</generator><language>zh-cn</language><lastBuildDate>Thu, 14 May 2020 17:16:41 +0000</lastBuildDate><atom:link href="https://goplscn.github.io/tags/syntax/index.xml" rel="self" type="application/rss+xml"/><item><title>HTML 特殊符号编码对照表</title><link>https://goplscn.github.io/post/html-chars/</link><pubDate>Thu, 14 May 2020 17:16:41 +0000</pubDate><guid>https://goplscn.github.io/post/html-chars/</guid><description>HTML 特殊符号编码对照表 特殊符号 命名实体 十进制编码 特殊符号 命名实体 十进制编码 特殊符号 命名实体 十进制编码 Α &amp;amp;Alpha; &amp;amp;#913; Β &amp;amp;Beta; &amp;amp;#914; Γ &amp;amp;Gamma; &amp;amp;#915; Δ &amp;amp;Delta; &amp;amp;#916; Ε &amp;amp;Epsilon; &amp;amp;#917; Ζ &amp;amp;Zeta; &amp;amp;#918; Η &amp;amp;Eta; &amp;amp;#919; Θ &amp;amp;Theta; &amp;amp;#920; Ι &amp;amp;Iota; &amp;amp;#921; Κ &amp;amp;Kappa; &amp;amp;#922; Λ &amp;amp;Lambda; &amp;amp;#923; Μ &amp;amp;Mu; &amp;amp;#924; Ν &amp;amp;Nu; &amp;amp;#925; Ξ &amp;amp;Xi; &amp;amp;#926; Ο &amp;amp;Omicron; &amp;amp;#927; Π &amp;amp;Pi; &amp;amp;#928; Ρ &amp;amp;Rho; &amp;amp;#929; Σ &amp;amp;Sigma; &amp;amp;#931; Τ &amp;amp;Tau; &amp;amp;#932; Υ &amp;amp;Upsilon; &amp;amp;#933; Φ &amp;amp;Phi; &amp;amp;#934; Χ &amp;amp;Chi; &amp;amp;#935; Ψ &amp;amp;Psi; &amp;amp;#936; Ω &amp;amp;Omega; &amp;amp;#937; α &amp;amp;alpha; &amp;amp;#945; β &amp;amp;beta; &amp;amp;#946; γ &amp;amp;gamma; &amp;amp;#947; δ &amp;amp;delta; &amp;amp;#948; ε &amp;amp;epsilon; &amp;amp;#949; ζ &amp;amp;zeta; &amp;amp;#950; η &amp;amp;eta; &amp;amp;#951; θ &amp;amp;theta; &amp;amp;#952; ι &amp;amp;iota; &amp;amp;#953; κ &amp;amp;kappa; &amp;amp;#954; λ &amp;amp;lambda; &amp;amp;#955; μ &amp;amp;mu; &amp;amp;#956; ν &amp;amp;nu; &amp;amp;#957; ξ &amp;amp;xi; &amp;amp;#958; ο &amp;amp;omicron; &amp;amp;#959; π &amp;amp;pi; &amp;amp;#960; ρ &amp;amp;rho; &amp;amp;#961; ς &amp;amp;sigmaf; &amp;amp;#962; σ &amp;amp;sigma; &amp;amp;#963; τ &amp;amp;tau; &amp;amp;#964; υ &amp;amp;upsilon; &amp;amp;#965; φ &amp;amp;phi; &amp;amp;#966; χ &amp;amp;chi; &amp;amp;#967; ψ &amp;amp;psi; &amp;amp;#968; ω &amp;amp;omega; &amp;amp;#969; ϑ &amp;amp;thetasym; &amp;amp;#977; ϒ &amp;amp;upsih; &amp;amp;#978; ϖ &amp;amp;piv; &amp;amp;#982; • &amp;amp;bull; &amp;amp;#8226; … &amp;amp;hellip; &amp;amp;#8230; ′ &amp;amp;prime; &amp;amp;#8242; ″ &amp;amp;Prime; &amp;amp;#8243; ‾ &amp;amp;oline; &amp;amp;#8254; ⁄ &amp;amp;frasl; &amp;amp;#8260; ℘ &amp;amp;weierp; &amp;amp;#8472; ℑ &amp;amp;image; &amp;amp;#8465; ℜ &amp;amp;real; &amp;amp;#8476; ™ &amp;amp;trade; &amp;amp;#8482; ℵ &amp;amp;alefsym; &amp;amp;#8501; ← &amp;amp;larr; &amp;amp;#8592; ↑ &amp;amp;uarr; &amp;amp;#8593; → &amp;amp;rarr; &amp;amp;#8594; ↓ &amp;amp;darr; &amp;amp;#8595; ↔ &amp;amp;harr; &amp;amp;#8596; ↵ &amp;amp;crarr; &amp;amp;#8629; ⇐ &amp;amp;lArr; &amp;amp;#8656; ⇑ &amp;amp;uArr; &amp;amp;#8657; ⇒ &amp;amp;rArr; &amp;amp;#8658; ⇓ &amp;amp;dArr; &amp;amp;#8659; ⇔ &amp;amp;hArr; &amp;amp;#8660; ∀ &amp;amp;forall; &amp;amp;#8704; ∂ &amp;amp;part; &amp;amp;#8706; ∃ &amp;amp;exist; &amp;amp;#8707; ∅ &amp;amp;empty; &amp;amp;#8709; ∇ &amp;amp;nabla; &amp;amp;#8711; ∈ &amp;amp;isin; &amp;amp;#8712; ∉ &amp;amp;notin; &amp;amp;#8713; ∋ &amp;amp;ni; &amp;amp;#8715; ∏ &amp;amp;prod; &amp;amp;#8719; ∑ &amp;amp;sum; &amp;amp;#8722; − &amp;amp;minus; &amp;amp;#8722; ∗ &amp;amp;lowast; &amp;amp;#8727; √ &amp;amp;radic; &amp;amp;#8730; ∝ &amp;amp;prop; &amp;amp;#8733; ∞ &amp;amp;infin; &amp;amp;#8734; ∠ &amp;amp;ang; &amp;amp;#8736; ∧ &amp;amp;and; &amp;amp;#8869; ∨ &amp;amp;or; &amp;amp;#8870; ∩ &amp;amp;cap; &amp;amp;#8745; ∪ &amp;amp;cup; &amp;amp;#8746; ∫ &amp;amp;int; &amp;amp;#8747; ∴ &amp;amp;there4; &amp;amp;#8756; ∼ &amp;amp;sim; &amp;amp;#8764; ≅ &amp;amp;cong; &amp;amp;#8773; ≈ &amp;amp;asymp; &amp;amp;#8773; ≠ &amp;amp;ne; &amp;amp;#8800; ≡ &amp;amp;equiv; &amp;amp;#8801; ≤ &amp;amp;le; &amp;amp;#8804; ≥ &amp;amp;ge; &amp;amp;#8805; ⊂ &amp;amp;sub; &amp;amp;#8834; ⊃ &amp;amp;sup; &amp;amp;#8835; ⊄ &amp;amp;nsub; &amp;amp;#8836; ⊆ &amp;amp;sube; &amp;amp;#8838; ⊇ &amp;amp;supe; &amp;amp;#8839; ⊕ &amp;amp;oplus; &amp;amp;#8853; ⊗ &amp;amp;otimes; &amp;amp;#8855; ⊥ &amp;amp;perp; &amp;amp;#8869; ⋅ &amp;amp;sdot; &amp;amp;#8901; ⌈ &amp;amp;lceil; &amp;amp;#8968; ⌉ &amp;amp;rceil; &amp;amp;#8969; ⌊ &amp;amp;lfloor; &amp;amp;#8970; ⌋ &amp;amp;rfloor; &amp;amp;#8971; ◊ &amp;amp;loz; &amp;amp;#9674; ♠ &amp;amp;spades; &amp;amp;#9824; ♣ &amp;amp;clubs; &amp;amp;#9827; ♥ &amp;amp;hearts; &amp;amp;#9829; ♦ &amp;amp;diams; &amp;amp;#9830; &amp;amp;nbsp; &amp;amp;#160; ¡ &amp;amp;iexcl; &amp;amp;#161; ¢ &amp;amp;cent; &amp;amp;#162; £ &amp;amp;pound; &amp;amp;#163; ¤ &amp;amp;curren; &amp;amp;#164; ¥ &amp;amp;yen; &amp;amp;#165; ¦ &amp;amp;brvbar; &amp;amp;#166; § &amp;amp;sect; &amp;amp;#167; ¨ &amp;amp;uml; &amp;amp;#168; © &amp;amp;copy; &amp;amp;#169; ª &amp;amp;ordf; &amp;amp;#170; « &amp;amp;laquo; &amp;amp;#171; ¬ &amp;amp;not; &amp;amp;#172; ­ &amp;amp;shy; &amp;amp;#173; ® &amp;amp;reg; &amp;amp;#174; ¯ &amp;amp;macr; &amp;amp;#175; ° &amp;amp;deg; &amp;amp;#176; ± &amp;amp;plusmn; &amp;amp;#177; ² &amp;amp;sup2; &amp;amp;#178; ³ &amp;amp;sup3; &amp;amp;#179; ´ &amp;amp;acute; &amp;amp;#180; µ &amp;amp;micro; &amp;amp;#181; &amp;quot; &amp;amp;quot; &amp;amp;#34; &amp;lt; &amp;amp;lt; &amp;amp;#60; &amp;gt; &amp;amp;gt; &amp;amp;#62; ' &amp;amp;#39;</description></item><item><title>MySQL show syntax and server status variables</title><link>https://goplscn.github.io/en/post/mysql-show-syntax-and-performance-status-variable/</link><pubDate>Sat, 28 Dec 2019 16:56:12 +0000</pubDate><guid>https://goplscn.github.io/en/post/mysql-show-syntax-and-performance-status-variable/</guid><description>SHOW Syntax SHOW has many forms that provide information about databases, tables, columns, or status information about the server. This section describes those following:
1SHOW {BINARY | MASTER} LOGS 2SHOW BINLOG EVENTS [IN &amp;#39;log_name&amp;#39;] [FROM pos] [LIMIT [offset,] row_count] 3SHOW CHARACTER SET [like_or_where] 4SHOW COLLATION [like_or_where] 5SHOW [FULL] COLUMNS FROM tbl_name [FROM db_name] [like_or_where] 6SHOW CREATE DATABASE db_name 7SHOW CREATE EVENT event_name 8SHOW CREATE FUNCTION func_name 9SHOW CREATE PROCEDURE proc_name 10SHOW CREATE TABLE tbl_name 11SHOW CREATE TRIGGER trigger_name 12SHOW CREATE VIEW view_name 13SHOW DATABASES [like_or_where] 14SHOW ENGINE engine_name {STATUS | MUTEX} 15SHOW [STORAGE] ENGINES 16SHOW ERRORS [LIMIT [offset,] row_count] 17SHOW EVENTS 18SHOW FUNCTION CODE func_name 19SHOW FUNCTION STATUS [like_or_where] 20SHOW GRANTS FOR user 21SHOW INDEX FROM tbl_name [FROM db_name] 22SHOW MASTER STATUS 23SHOW OPEN TABLES [FROM db_name] [like_or_where] 24SHOW PLUGINS 25SHOW PROCEDURE CODE proc_name 26SHOW PROCEDURE STATUS [like_or_where] 27SHOW PRIVILEGES 28SHOW [FULL] PROCESSLIST 29SHOW PROFILE [types] [FOR QUERY n] [OFFSET n] [LIMIT n] 30SHOW PROFILES 31SHOW RELAYLOG EVENTS [IN &amp;#39;log_name&amp;#39;] [FROM pos] [LIMIT [offset,] row_count] 32SHOW SLAVE HOSTS 33SHOW SLAVE STATUS [FOR CHANNEL channel] 34SHOW [GLOBAL | SESSION] STATUS [like_or_where] 35SHOW TABLE STATUS [FROM db_name] [like_or_where] 36SHOW [FULL] TABLES [FROM db_name] [like_or_where] 37SHOW TRIGGERS [FROM db_name] [like_or_where] 38SHOW [GLOBAL | SESSION] VARIABLES [like_or_where] 39SHOW WARNINGS [LIMIT [offset,] row_count] 40 41like_or_where: 42 LIKE &amp;#39;pattern&amp;#39; 43 | WHERE expr If the syntax for a given SHOW statement includes a LIKE '*pattern*' part, '*pattern*' is a string that can contain the SQL % and _ wildcard characters.</description></item><item><title>MySQL Statement Syntax</title><link>https://goplscn.github.io/en/post/usefull-mysql-sql-statement-syntax/</link><pubDate>Fri, 27 Dec 2019 13:01:17 +0000</pubDate><guid>https://goplscn.github.io/en/post/usefull-mysql-sql-statement-syntax/</guid><description>DATABASE ALTER DATABASE Syntax 1ALTER {DATABASE | SCHEMA} [db_name] 2 alter_specification ... 3 4alter_specification: 5 [DEFAULT] CHARACTER SET [=] charset_name 6 | [DEFAULT] COLLATE [=] collation_name 7 | DEFAULT ENCRYPTION [=] {&amp;#39;Y&amp;#39; | &amp;#39;N&amp;#39;} ALTER DATABASE enables you to change the overall characteristics of a database. These characteristics are stored in the data dictionary. To use ALTER DATABASE, you need the ALTER privilege on the database. ALTER SCHEMA is a synonym for ALTER DATABASE.</description></item></channel></rss>